IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_TASKS_MGR_RTU1_PR1_TASKS_MGR_RTU1_MMR.xml
<module name="PRU_ICSSG0_PR1_TASKS_MGR_RTU1_PR1_TASKS_MGR_RTU1_MMR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_global_cfg" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_global_cfg" offset="0x0" width="32" description="Global Configuration">
		<bitfield id="TS2_EN_S4" width="1" begin="11" end="11" resetval="0x0" description="TS2 Sub4  0: Disabled 1: Enabled" range="11" rwaccess="R/W"/> 
		<bitfield id="TS2_EN_S3" width="1" begin="10" end="10" resetval="0x0" description="TS2 Sub3  0: Disabled 1: Enabled" range="10" rwaccess="R/W"/> 
		<bitfield id="TS2_EN_S2" width="1" begin="9" end="9" resetval="0x0" description="TS2 Sub2  0: Disabled 1: Enabled" range="9" rwaccess="R/W"/> 
		<bitfield id="TS2_EN_S1" width="1" begin="8" end="8" resetval="0x0" description="TS2 Sub1  0: Disabled 1: Enabled" range="8" rwaccess="R/W"/> 
		<bitfield id="TS2_EN_S0" width="1" begin="7" end="7" resetval="0x0" description="TS2 Sub0  0: Disabled 1: Enabled" range="7" rwaccess="R/W"/> 
		<bitfield id="TS1_EN_S4" width="1" begin="6" end="6" resetval="0x0" description="TS1 Sub4  0: Disabled 1: Enabled" range="6" rwaccess="R/W"/> 
		<bitfield id="TS1_EN_S3" width="1" begin="5" end="5" resetval="0x0" description="TS1 Sub3  0: Disabled 1: Enabled" range="5" rwaccess="R/W"/> 
		<bitfield id="TS1_EN_S2" width="1" begin="4" end="4" resetval="0x0" description="TS1 Sub2  0: Disabled 1: Enabled" range="4" rwaccess="R/W"/> 
		<bitfield id="TS1_EN_S1" width="1" begin="3" end="3" resetval="0x0" description="TS1 Sub1  0: Disabled 1: Enabled" range="3" rwaccess="R/W"/> 
		<bitfield id="TS1_EN_S0" width="1" begin="2" end="2" resetval="0x0" description="TS1 Sub0  0: Disabled 1: Enabled" range="2" rwaccess="R/W"/> 
		<bitfield id="TASKS_MGR_MODE" width="2" begin="1" end="0" resetval="0x0" description="TaskSwap Mode 0: Disabled 1: RXTX 2: General_HW " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_global_status" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_global_status" offset="0x4" width="32" description="Global Status">
		<bitfield id="TS2_SUB_PEND_4" width="1" begin="17" end="17" resetval="0x0" description="Task2 Sub4 Pend State " range="17" rwaccess="RO"/> 
		<bitfield id="TS2_SUB_PEND_3" width="1" begin="16" end="16" resetval="0x0" description="Task2 Sub3 Pend State " range="16" rwaccess="RO"/> 
		<bitfield id="TS2_SUB_PEND_2" width="1" begin="15" end="15" resetval="0x0" description="Task2 Sub2 Pend State " range="15" rwaccess="RO"/> 
		<bitfield id="TS2_SUB_PEND_1" width="1" begin="14" end="14" resetval="0x0" description="Task2 Sub1 Pend State " range="14" rwaccess="RO"/> 
		<bitfield id="TS2_SUB_PEND_0" width="1" begin="13" end="13" resetval="0x0" description="Task2 Sub0 Pend State " range="13" rwaccess="RO"/> 
		<bitfield id="TS1_SUB_PEND_4" width="1" begin="12" end="12" resetval="0x0" description="Task1 Sub4 Pend State " range="12" rwaccess="RO"/> 
		<bitfield id="TS1_SUB_PEND_3" width="1" begin="11" end="11" resetval="0x0" description="Task1 Sub3 Pend State " range="11" rwaccess="RO"/> 
		<bitfield id="TS1_SUB_PEND_2" width="1" begin="10" end="10" resetval="0x0" description="Task1 Sub2 Pend State " range="10" rwaccess="RO"/> 
		<bitfield id="TS1_SUB_PEND_1" width="1" begin="9" end="9" resetval="0x0" description="Task1 Sub1 Pend State " range="9" rwaccess="RO"/> 
		<bitfield id="TS1_SUB_PEND_0" width="1" begin="8" end="8" resetval="0x0" description="Task1 Sub0 Pend State " range="8" rwaccess="RO"/> 
		<bitfield id="TS2_STATE" width="4" begin="7" end="4" resetval="0x0" description="Task2 State" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="TS1_STATE" width="4" begin="3" end="0" resetval="0x0" description="Task1 State" range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s0" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s0" offset="0x8" width="32" description="TS1 Sub0 PC ">
		<bitfield id="TS1_PC_S0" width="14" begin="13" end="0" resetval="0x0" description="TS1 Sub0 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s1" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s1" offset="0xC" width="32" description="TS1 Sub1 PC ">
		<bitfield id="TS1_PC_S1" width="14" begin="13" end="0" resetval="0x0" description="TS1 Sub1 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s2" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s2" offset="0x10" width="32" description="TS1 Sub2 PC ">
		<bitfield id="TS1_PC_S2" width="14" begin="13" end="0" resetval="0x0" description="TS1 Sub2 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s3" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s3" offset="0x14" width="32" description="TS1 Sub3 PC ">
		<bitfield id="TS1_PC_S3" width="14" begin="13" end="0" resetval="0x0" description="TS1 Sub3 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s4" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_pc_s4" offset="0x18" width="32" description="TS1 Sub4 PC ">
		<bitfield id="TS1_PC_S4" width="14" begin="13" end="0" resetval="0x0" description="TS1 Sub4 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s0" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s0" offset="0x1C" width="32" description="TS2 Sub0 PC ">
		<bitfield id="TS2_PC_S0" width="14" begin="13" end="0" resetval="0x0" description="TS2 Sub0 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s1" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s1" offset="0x20" width="32" description="TS2 Sub1 PC ">
		<bitfield id="TS2_PC_S1" width="14" begin="13" end="0" resetval="0x0" description="TS2 Sub1 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s2" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s2" offset="0x24" width="32" description="TS2 Sub2 PC ">
		<bitfield id="TS2_PC_S2" width="14" begin="13" end="0" resetval="0x0" description="TS2 Sub2 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s3" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s3" offset="0x28" width="32" description="TS2 Sub3 PC ">
		<bitfield id="TS2_PC_S3" width="14" begin="13" end="0" resetval="0x0" description="TS2 Sub3 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s4" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_pc_s4" offset="0x2C" width="32" description="TS2 Sub4 PC ">
		<bitfield id="TS2_PC_S4" width="14" begin="13" end="0" resetval="0x0" description="TS2 Sub4 PC " range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_rx_cfg" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_rx_cfg" offset="0x30" width="32" description="RX Configuration">
		<bitfield id="BKN_SIZE" width="5" begin="14" end="10" resetval="0x31" description="RX BKN Size, After BK1 and BK@, then after another 1 to 32 Bytes" range="14 - 10" rwaccess="R/W"/> 
		<bitfield id="BK2_SIZE" width="5" begin="9" end="5" resetval="0x31" description="RX BK2 Size,  The Second  1 to 32 Bytes trigger" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="BK1_SIZE" width="5" begin="4" end="0" resetval="0x31" description="RX BK1 Size , The first 1 to 32 Bytes trigger" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_tx_cfg" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_tx_cfg" offset="0x34" width="32" description="TX Configuration">
		<bitfield id="TX_WM" width="6" begin="5" end="0" resetval="0x31" description="TX L2 Water Mark Level 1 to 64 Bytes" range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_gen_cfg1" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_gen_cfg1" offset="0x38" width="32" description="Generic TS1 Configuration1">
		<bitfield id="TS1_GEN_S3_MX" width="8" begin="31" end="24" resetval="0x0" description="TS1 Generic Sub3 MX Select" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TS1_GEN_S2_MX" width="8" begin="23" end="16" resetval="0x0" description="TS1 Generic Sub2 MX Select" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TS1_GEN_S1_MX" width="8" begin="15" end="8" resetval="0x0" description="TS1 Generic Sub1 MX Select" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TS1_GEN_S0_MX" width="8" begin="7" end="0" resetval="0x0" description="TS1 Generic Sub0 MX Select" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_gen_cfg2" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts1_gen_cfg2" offset="0x3C" width="32" description="Generic TS1 Configuration2">
		<bitfield id="TS1_GEN_S4_MX" width="8" begin="7" end="0" resetval="0x0" description="TS1 Generic Sub4 MX Select" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_gen_cfg1" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_gen_cfg1" offset="0x40" width="32" description="Generic TS2 Configuration1">
		<bitfield id="TS2_GEN_S3_MX" width="8" begin="31" end="24" resetval="0x0" description="TS2 Generic Sub3 MX Select" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TS2_GEN_S2_MX" width="8" begin="23" end="16" resetval="0x0" description="TS2 Generic Sub2 MX Select" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TS2_GEN_S1_MX" width="8" begin="15" end="8" resetval="0x0" description="TS2 Generic Sub1 MX Select" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TS2_GEN_S0_MX" width="8" begin="7" end="0" resetval="0x0" description="TS2 Generic Sub0 MX Select" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_gen_cfg2" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_ts2_gen_cfg2" offset="0x44" width="32" description="Generic TS2 Configuration2">
		<bitfield id="TS2_GEN_S4_MX" width="8" begin="7" end="0" resetval="0x0" description="TS2 Generic Sub4 MX Select" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_cap_en_cfg" acronym="PR1_TASKS_MGR_RTU1__PR1_TASKS_MGR_RTU1_MMR__REGS_cap_en_cfg" offset="0x48" width="32" description="Enable capture new event cfg">
		<bitfield id="NEW_CAP_EN" width="10" begin="9" end="0" resetval="0x0" description="Capture new event while in the same task Enable TS1_S0 = [0] .. TS2_S4 = [9]" range="9 - 0" rwaccess="R/W"/>
	</register>
</module>